MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GP502/mcu.h
#define _C1RXFUL2_RXFUL29_POSITION               0x0000000D
#define _C1RXFUL2_RXFUL29_MASK                   0x00002000
#define _C1RXFUL2_RXFUL29_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL30_POSITION               0x0000000E
#define _C1RXFUL2_RXFUL30_MASK                   0x00004000
#define _C1RXFUL2_RXFUL30_LENGTH                 0x00000001

#define _C1RXFUL2_RXFUL31_POSITION               0x0000000F
#define _C1RXFUL2_RXFUL31_MASK                   0x00008000
#define _C1RXFUL2_RXFUL31_LENGTH                 0x00000001

#define _C1BUFPNT3_F8BP_POSITION                 0x00000000
#define _C1BUFPNT3_F8BP_MASK                     0x0000000F
#define _C1BUFPNT3_F8BP_LENGTH                   0x00000004

#define _C1BUFPNT3_F9BP_POSITION                 0x00000004
#define _C1BUFPNT3_F9BP_MASK                     0x000000F0
#define _C1BUFPNT3_F9BP_LENGTH                   0x00000004

#define _C1BUFPNT3_F10BP_POSITION                0x00000008
#define _C1BUFPNT3_F10BP_MASK                    0x00000F00
#define _C1BUFPNT3_F10BP_LENGTH                  0x00000004

#define _C1BUFPNT3_F11BP_POSITION                0x0000000C
#define _C1BUFPNT3_F11BP_MASK                    0x0000F000
#define _C1BUFPNT3_F11BP_LENGTH                  0x00000004

#define _C1BUFPNT3_F8BP0_POSITION                0x00000000
#define _C1BUFPNT3_F8BP0_MASK                    0x00000001
#define _C1BUFPNT3_F8BP0_LENGTH                  0x00000001

#define _C1BUFPNT3_F8BP1_POSITION                0x00000001
#define _C1BUFPNT3_F8BP1_MASK                    0x00000002
#define _C1BUFPNT3_F8BP1_LENGTH                  0x00000001

#define _C1BUFPNT3_F8BP2_POSITION                0x00000002
#define _C1BUFPNT3_F8BP2_MASK                    0x00000004
#define _C1BUFPNT3_F8BP2_LENGTH                  0x00000001

#define _C1BUFPNT3_F8BP3_POSITION                0x00000003
#define _C1BUFPNT3_F8BP3_MASK                    0x00000008
#define _C1BUFPNT3_F8BP3_LENGTH                  0x00000001

#define _C1BUFPNT3_F9BP0_POSITION                0x00000004
#define _C1BUFPNT3_F9BP0_MASK                    0x00000010
#define _C1BUFPNT3_F9BP0_LENGTH                  0x00000001

#define _C1BUFPNT3_F9BP1_POSITION                0x00000005
#define _C1BUFPNT3_F9BP1_MASK                    0x00000020
#define _C1BUFPNT3_F9BP1_LENGTH                  0x00000001

#define _C1BUFPNT3_F9BP2_POSITION                0x00000006
#define _C1BUFPNT3_F9BP2_MASK                    0x00000040
#define _C1BUFPNT3_F9BP2_LENGTH                  0x00000001

#define _C1BUFPNT3_F9BP3_POSITION                0x00000007
#define _C1BUFPNT3_F9BP3_MASK                    0x00000080
#define _C1BUFPNT3_F9BP3_LENGTH                  0x00000001

#define _C1BUFPNT3_F10BP0_POSITION               0x00000008
#define _C1BUFPNT3_F10BP0_MASK                   0x00000100
#define _C1BUFPNT3_F10BP0_LENGTH                 0x00000001

#define _C1BUFPNT3_F10BP1_POSITION               0x00000009
#define _C1BUFPNT3_F10BP1_MASK                   0x00000200
#define _C1BUFPNT3_F10BP1_LENGTH                 0x00000001

#define _C1BUFPNT3_F10BP2_POSITION               0x0000000A
#define _C1BUFPNT3_F10BP2_MASK                   0x00000400
#define _C1BUFPNT3_F10BP2_LENGTH                 0x00000001

#define _C1BUFPNT3_F10BP3_POSITION               0x0000000B
#define _C1BUFPNT3_F10BP3_MASK                   0x00000800
#define _C1BUFPNT3_F10BP3_LENGTH                 0x00000001

#define _C1BUFPNT3_F11BP0_POSITION               0x0000000C
#define _C1BUFPNT3_F11BP0_MASK                   0x00001000
#define _C1BUFPNT3_F11BP0_LENGTH                 0x00000001

#define _C1BUFPNT3_F11BP1_POSITION               0x0000000D
#define _C1BUFPNT3_F11BP1_MASK                   0x00002000
#define _C1BUFPNT3_F11BP1_LENGTH                 0x00000001

#define _C1BUFPNT3_F11BP2_POSITION               0x0000000E
#define _C1BUFPNT3_F11BP2_MASK                   0x00004000
#define _C1BUFPNT3_F11BP2_LENGTH                 0x00000001

#define _C1BUFPNT3_F11BP3_POSITION               0x0000000F
#define _C1BUFPNT3_F11BP3_MASK                   0x00008000
#define _C1BUFPNT3_F11BP3_LENGTH                 0x00000001

#define _C1BUFPNT4_F12BP_POSITION                0x00000000
#define _C1BUFPNT4_F12BP_MASK                    0x0000000F
#define _C1BUFPNT4_F12BP_LENGTH                  0x00000004

#define _C1BUFPNT4_F13BP_POSITION                0x00000004
#define _C1BUFPNT4_F13BP_MASK                    0x000000F0
#define _C1BUFPNT4_F13BP_LENGTH                  0x00000004

#define _C1BUFPNT4_F14BP_POSITION                0x00000008
#define _C1BUFPNT4_F14BP_MASK                    0x00000F00
#define _C1BUFPNT4_F14BP_LENGTH                  0x00000004

#define _C1BUFPNT4_F15BP_POSITION                0x0000000C
#define _C1BUFPNT4_F15BP_MASK                    0x0000F000
#define _C1BUFPNT4_F15BP_LENGTH                  0x00000004

#define _C1BUFPNT4_F12BP0_POSITION               0x00000000
#define _C1BUFPNT4_F12BP0_MASK                   0x00000001
#define _C1BUFPNT4_F12BP0_LENGTH                 0x00000001

#define _C1BUFPNT4_F12BP1_POSITION               0x00000001
#define _C1BUFPNT4_F12BP1_MASK                   0x00000002
#define _C1BUFPNT4_F12BP1_LENGTH                 0x00000001

#define _C1BUFPNT4_F12BP2_POSITION               0x00000002
#define _C1BUFPNT4_F12BP2_MASK                   0x00000004
#define _C1BUFPNT4_F12BP2_LENGTH                 0x00000001

#define _C1BUFPNT4_F12BP3_POSITION               0x00000003
#define _C1BUFPNT4_F12BP3_MASK                   0x00000008
#define _C1BUFPNT4_F12BP3_LENGTH                 0x00000001

#define _C1BUFPNT4_F13BP0_POSITION               0x00000004
#define _C1BUFPNT4_F13BP0_MASK                   0x00000010
#define _C1BUFPNT4_F13BP0_LENGTH                 0x00000001

#define _C1BUFPNT4_F13BP1_POSITION               0x00000005
#define _C1BUFPNT4_F13BP1_MASK                   0x00000020
#define _C1BUFPNT4_F13BP1_LENGTH                 0x00000001

#define _C1BUFPNT4_F13BP2_POSITION               0x00000006
#define _C1BUFPNT4_F13BP2_MASK                   0x00000040
#define _C1BUFPNT4_F13BP2_LENGTH                 0x00000001

#define _C1BUFPNT4_F13BP3_POSITION               0x00000007
#define _C1BUFPNT4_F13BP3_MASK                   0x00000080
#define _C1BUFPNT4_F13BP3_LENGTH                 0x00000001

#define _C1BUFPNT4_F14BP0_POSITION               0x00000008
#define _C1BUFPNT4_F14BP0_MASK                   0x00000100
#define _C1BUFPNT4_F14BP0_LENGTH                 0x00000001

